Tekla Open API Reference for Tekla Structures 2025
PluginFormBase.ReloadForm Method
 Reloads the dialog values.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ReloadForm()
Public Sub ReloadForm
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace